"""Выведите в консоль их значения в столбик
(каждое новое значение отображается с новой строчки), используя одну функцию print."""


print(7, -4, 3, sep='\n')