"""Выведите в консоль их значения, используя одну функцию print
(между значениями переменных должен стоять один пробел)."""


print(7, -4, 3, sep=' ')