"""Составить программу вывода на экран вещественного числа, вводимого с клавиатуры.
Выводимому числу должно предшествовать сообщение "Вы ввели число" (без кавычек)."""

print(float(input('Вы ввели число ')))

print('Вы ввели число', float(input()))

print(f"Вы ввели число {float(input())}")
